report.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-04 Sat 20:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Acoustics Report TODO: Go back and add defs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matt Dailis" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/></head>
<body>
<div id="content">
<h1 class="title">Acoustics Report TODO: Go back and add defs
<br />
<span class="subtitle">Matt Dailis, Northeastern University MUSC2350, Spring 2020</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org861a673">Section 1: Simulating Strings</a></li>
<li><a href="#orgc880609">Section 2: Coming Soon</a></li>
<li><a href="#org30703f1">Unsorted</a></li>
</ul>
</div>
</div>

<div id="outline-container-org861a673" class="outline-2">
<h2 id="org861a673">Section 1: Simulating Strings</h2>
<div class="outline-text-2" id="text-org861a673">
<p>
My intent is to attempt to simulate a guitar using purely math.
</p>

<p>
I am using <i><a href="https://www.gnu.org/software/octave/">GNU Octave</a></i>, an open source programming language and
environment for mathematical modeling, based off of <a href="https://www.mathworks.com/products/matlab.html">MATLAB</a>.
</p>

<p>
Octave has an audioplayer function (<i>See Listing <a href="#orgbfaa340">1</a></i>). If
I provide it with a vector of floating point numbers between -1 and 1,
it will treat them as a waveform and play them back for me.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>The octave <i>audioplayer</i> function</label><pre class="src src-octave" id="orgbfaa340">player <span style="color: #006FE0;">=</span> audioplayer (vector<span style="color: #006FE0;">,</span> bit_rate<span style="color: #006FE0;">,</span> bit_depth)
</pre>
</div>


<p>
A <i>sample</i> is a discrete measurement of <i>sound pressure level</i> (SPL).
</p>

<p>
<code>bit_rate</code> is the number of samples to play per second. I will set
this to be <b>44100</b><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p>

<p>
I'm not sure what <code>bit_depth</code> means - it seems to have to do with the
precision of the floating point numbers themselves.
</p>

<p>
I will try to simulate a vibrating string by building it up as a sum
of partials. To start, I tried to make the fundamental frequency using
octave's <code>sinewave</code> function <i>(See Listing <a href="#org1fd087f">2</a>)</i>. I can
provide it a vector size and a period, and it will return a set of
values between -1 and 1 in the form of a sine wave with a period that
I specify.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Octave provides a convenient sinewave function, which asks for a vector size and a period</label><pre class="src src-octave" id="org1fd087f">f1 <span style="color: #006FE0;">=</span> sinewave(BIT_RATE <span style="color: #006FE0;">*</span> 4<span style="color: #006FE0;">,</span> BIT_RATE <span style="color: #006FE0;">/</span> 440)
</pre>
</div>

<p>
I defined my own convenience function <code>puretone</code> which would take the
bit rate, duration, and frequency and return the corresponding sine
wave <i>(See Listing <a href="#org702f7a3">3</a>)</i>.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>I defined my own <code>puretone</code> function which allows me to think in terms of frequency instead of period</label><pre class="src src-octave" id="org702f7a3"><span style="color: #0000FF;">function</span> y <span style="color: #006FE0;">=</span> <span style="color: #006699;">puretone</span>(BIT_RATE<span style="color: #006FE0;">,</span> seconds<span style="color: #006FE0;">,</span> frequency<span style="color: #006FE0;">,</span> phase_shift<span style="color: #006FE0;">=</span>0)
  y <span style="color: #006FE0;">=</span> sinewave(BIT_RATE <span style="color: #006FE0;">*</span> seconds<span style="color: #006FE0;">,</span> BIT_RATE<span style="color: #006FE0;">/</span>frequency<span style="color: #006FE0;">,</span> phase_shift)<span style="color: #006FE0;">;</span>
<span style="color: #0000FF;">endfunction</span>
</pre>
</div>

<p>
Okay, now I have the ability to make pure tones, but I want
harmonics. A harmonic is a partial whose frequency is an <i>integer</i>
<i>multiple of the fundamental</i>. We usually only care about the first
six harmonics or so, because after that they start to get to very high
frequencies. Let's define a <code>createharmonics</code> function that returns a
sum of six harmonics <i>(See Listing <a href="#org6343157">4</a>)</i>. Notice that
the returned vector must be divided by six to preserve the range of
values to be between -1 and 1.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span><code>createharmonics</code> generates the first six harmonics and adds them together</label><pre class="src src-octave" id="org6343157"><span style="color: #0000FF;">function</span> y <span style="color: #006FE0;">=</span> <span style="color: #006699;">createharmonics</span>(BIT_RATE<span style="color: #006FE0;">,</span> DURATION<span style="color: #006FE0;">,</span> fundamental)
  f1 <span style="color: #006FE0;">=</span> puretone(BIT_RATE<span style="color: #006FE0;">,</span> DURATION<span style="color: #006FE0;">,</span> fundamental)<span style="color: #006FE0;">;</span>
  f2 <span style="color: #006FE0;">=</span> puretone(BIT_RATE<span style="color: #006FE0;">,</span> DURATION<span style="color: #006FE0;">,</span> fundamental <span style="color: #006FE0;">*</span> 2)<span style="color: #006FE0;">;</span>
  f3 <span style="color: #006FE0;">=</span> puretone(BIT_RATE<span style="color: #006FE0;">,</span> DURATION<span style="color: #006FE0;">,</span> fundamental <span style="color: #006FE0;">*</span> 3)<span style="color: #006FE0;">;</span>
  f4 <span style="color: #006FE0;">=</span> puretone(BIT_RATE<span style="color: #006FE0;">,</span> DURATION<span style="color: #006FE0;">,</span> fundamental <span style="color: #006FE0;">*</span> 4)<span style="color: #006FE0;">;</span>
  f5 <span style="color: #006FE0;">=</span> puretone(BIT_RATE<span style="color: #006FE0;">,</span> DURATION<span style="color: #006FE0;">,</span> fundamental <span style="color: #006FE0;">*</span> 5)<span style="color: #006FE0;">;</span>
  f6 <span style="color: #006FE0;">=</span> puretone(BIT_RATE<span style="color: #006FE0;">,</span> DURATION<span style="color: #006FE0;">,</span> fundamental <span style="color: #006FE0;">*</span> 6)<span style="color: #006FE0;">;</span>
  y <span style="color: #006FE0;">=</span> (f1 <span style="color: #006FE0;">+</span> f2 <span style="color: #006FE0;">+</span> f3 <span style="color: #006FE0;">+</span> f4 <span style="color: #006FE0;">+</span> f5 <span style="color: #006FE0;">+</span> f6) <span style="color: #006FE0;">/</span> 6<span style="color: #006FE0;">;</span>
<span style="color: #0000FF;">endfunction</span>
</pre>
</div>

<p>
I created a sample song using this function
</p>

<div class="org-src-container">
<pre class="src src-octave">A3 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 220)<span style="color: #006FE0;">;</span>
A4 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 440)<span style="color: #006FE0;">;</span>
A5 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 880)<span style="color: #006FE0;">;</span>
B4 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 495)<span style="color: #006FE0;">;</span>
C4 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 523.26)<span style="color: #006FE0;">;</span>
D3 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 293.33)<span style="color: #006FE0;">;</span>
D4 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 293.33 <span style="color: #006FE0;">*</span> 2)<span style="color: #006FE0;">;</span>
D5 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 293.33 <span style="color: #006FE0;">*</span> 4)<span style="color: #006FE0;">;</span>
E3 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 330)<span style="color: #006FE0;">;</span>
E4 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 660)<span style="color: #006FE0;">;</span>
F5 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 348.84 <span style="color: #006FE0;">*</span> 2)<span style="color: #006FE0;">;</span>
GS4 <span style="color: #006FE0;">=</span> createharmonics(BIT_RATE<span style="color: #006FE0;">,</span> 0.5<span style="color: #006FE0;">,</span> 415.305)<span style="color: #006FE0;">;</span>

aMinor <span style="color: #006FE0;">=</span> [A4<span style="color: #006FE0;">,</span> (C4 <span style="color: #006FE0;">+</span> E4) <span style="color: #006FE0;">/</span> 2<span style="color: #006FE0;">,</span> E3<span style="color: #006FE0;">,</span> (C4 <span style="color: #006FE0;">+</span> E4) <span style="color: #006FE0;">/</span> 2]<span style="color: #006FE0;">;</span>
eMajor <span style="color: #006FE0;">=</span> [B4<span style="color: #006FE0;">,</span> (E4 <span style="color: #006FE0;">+</span> GS4) <span style="color: #006FE0;">/</span> 2<span style="color: #006FE0;">,</span> E3<span style="color: #006FE0;">,</span> (D4 <span style="color: #006FE0;">+</span> GS4) <span style="color: #006FE0;">/</span> 2]<span style="color: #006FE0;">;</span>
dMinor <span style="color: #006FE0;">=</span> [A4<span style="color: #006FE0;">,</span> (D4 <span style="color: #006FE0;">+</span> F5) <span style="color: #006FE0;">/</span> 2<span style="color: #006FE0;">,</span> D3<span style="color: #006FE0;">,</span> (D4 <span style="color: #006FE0;">+</span> F5) <span style="color: #006FE0;">/</span> 2]<span style="color: #006FE0;">;</span>

song <span style="color: #006FE0;">=</span> [aMinor<span style="color: #006FE0;">,</span> eMajor<span style="color: #006FE0;">,</span> aMinor<span style="color: #006FE0;">,</span> eMajor<span style="color: #006FE0;">,</span> dMinor<span style="color: #006FE0;">,</span> aMinor<span style="color: #006FE0;">,</span> eMajor<span style="color: #006FE0;">,</span> A4<span style="color: #006FE0;">,</span> E3<span style="color: #006FE0;">,</span> A3]<span style="color: #006FE0;">;</span>
playSound(song<span style="color: #006FE0;">,</span> BIT_RATE)
</pre>
</div>

<p>
You can hear the result here:
</p>

<p>
<audio controls src="output.wav"></audio>
</p>

<p>
While this is recognizably music, it sounds nothing like a guitar!
What are we missing?
</p>

<p>
First off, in a string, the relative amplitudes of the harmonics are
not all the same.<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> Secondly, for a plucked instrument, the amplitudes
of all of the harmonics change over time, eventually diminishing to
silence.<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> Lastly, the soundboard of the instrument will act as a filter
affecting the output of the instrument.<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> Let's tackle these one by one.
</p>
</div>

<div id="outline-container-org1cad691" class="outline-3">
<h3 id="org1cad691">Relative amplitudes of Harmonics</h3>
<div class="outline-text-3" id="text-org1cad691">
<p>
First off, the fundamental frequency of a plucked string will
always be the most prevalent harmonic.<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup> The
relative amplitudes of harmonics of a plucked string depend on the
pluck location.
</p>

<p>
We model a pluck as a "kink" in the string. <sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup> This
initial location of this kink determines the relative amplitudes of
the harmonics.<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup> 
</p>

<p>
If we take the <i>fourier transform of the string</i>, we should get an
idea for which frequencies are represented. Let's first define the
shape of our string.
</p>

<p>
Let's define a kink in terms of a piecewise function.
</p>

<p>
Let \(k\) be the kink location whose value is between \(0\) and \(1\),
and \(L\) be the length of the string.
</p>

<p>
\[y_1={\frac x Lk}\]
</p>

<p>
\[y_2 = {\frac {1 - {\frac x L}} {1 - k}}\]
</p>
</div>
</div>



<div id="outline-container-org793515b" class="outline-3">
<h3 id="org793515b">Damping</h3>
</div>

<div id="outline-container-orgae55511" class="outline-3">
<h3 id="orgae55511">Soundboard</h3>
</div>
</div>

<div id="outline-container-orgc880609" class="outline-2">
<h2 id="orgc880609">Section 2: Coming Soon</h2>
<div class="outline-text-2" id="text-orgc880609">
<p>
This has not yet been assigned
</p>
</div>
</div>


<div id="outline-container-org30703f1" class="outline-2">
<h2 id="org30703f1">Unsorted</h2>
<div class="outline-text-2" id="text-org30703f1">
<p>
The fundamental frequency of a string is \({\sqrt {\frac T \mu}} *
  {\frac 1 2L}\).
</p>

<p>
TODO: Define tone
TODO: Define note
TODO: Define timbre
TODO: Refer to <a href="http://www.falstad.com/loadedstring/">http://www.falstad.com/loadedstring/</a>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">44100 is a common sampling frequency because
of the Sony CD standard: <a href="https://en.wikipedia.org/wiki/44,100_Hz">https://en.wikipedia.org/wiki/44,100_Hz</a></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara">footnote me</div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara">footnote me</div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara">footnote me</div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara">TODO why&#x2026;?</div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara">TODO source</div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara">I said this already</div></div>


</div>
</div></div>
</body>
</html>
